Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--ideditor_quickstart.tmx
Source language: en
Languages: ja

source: iD editor Quickstart
ja: iDエディタ クイックスタート

source: The iD editor is the de facto, browser-based OpenStreetMap editor. iD is fast and easy to use, and allows mapping from various data sources such as satellite and aerial imageries, GPS, Field Papers or Mapillary.
ja: iDエディタは事実上、ブラウザベースのOpenStreetMapエディタです。iDは高速で使いやすく、衛星や航空画像、GPS、Field Papers、Mapillaryなどのさまざまなデータソースからのマッピングが可能です。

source: The iD editor is a great way to edit for small and easy changes that don't require the advanced features of JOSM (a more advanced mapping editor). This chapter demonstrates the basics of editing with iD.
ja: iDエディタは、JOSM(より高度なマッピングエディタ)の高度な機能を必要としない、小さくて簡単な変更を編集するための優れた方法です。この章では、iDを使用した編集の基本について説明します。

source: Starting the iD Editor
ja: iDエディタを起動する

source: The iD editor requires an active connection to the Internet.
ja: iDエディタには、インターネットへのアクティブな接続が必要です。

source: Open your Internet browser, and go to the OpenStreetMap website at https://www.openstreetmap.org.
ja: インターネットブラウザを開き、https://www.openstreetmap.orgのOpenStreetMapのWebサイトにアクセスします。

source: **Login** using your OpenStreetMap account.
ja: OpenStreetMapアカウントを使用して**ログイン**します。

source: Pan and zoom the map to the area that you want to edit. You can pan by holding the left mouse button and dragging the map to your desired area.
ja: 編集する領域にマップを画面移動およびズームします。マウスの左ボタンを押したままマップを目的の領域にドラッグすると、画面移動できます。

source: Click on the small arrow next to **Edit**, then click **Edit with iD (in-browser editor)**.
ja: **[編集]**の横の小さな矢印をクリックし、[**iD編集(ブラウザ内エディタ)**]をクリックします。

source: [1] **Edit Feature Panel:** This panel shows tags from the object
ja: [1]**[フィーチャ編集]パネル:**このパネルにはオブジェクトのタグが表示されます

source: selected on the map. You can add or edit tags from this panel.
ja: マップ上で選択されています。このパネルからタグを追加または編集できます。

source: [2] **Tools:** This panel shows basic editing tools.
ja: [2]**ツール:**このパネルには、基本的な編集ツールが表示されます。

source: [3] **Map panel:** This panel show various configuration functions.
ja: [3]**Mapパネル:**このパネルには、さまざまな設定機能が表示されます。

source: [4] **Information panel:** This panel shows various information, such as
ja: [4]**情報パネル:**このパネルには、次のようなさまざまな情報が表示されます。

source: the scale bar and which users have contributed to the area.
ja: スケールバーと、その領域にどのユーザが貢献したかを示します。

source: Configuring the background layer
ja: 背景レイヤーの設定

source: Click the **Background settings** button or use the *shortcut key* **b**. |image14|
ja: **背景設定**ボタンをクリックするか、*ショートカットキー***b**を使用します。|image14|

source: To change the **brightness level** click one of these boxes, the levels are 100%, 75%, 50%, and 25% |image16|
ja: **輝度レベル**を変更するには、これらのボックスの1つをクリックします。レベルは、100%、75%、50%、および25%の|image16|です。

source: You also can **change the background layer** based on your desired tile provider (the default is Bing Aerial Imagery).
ja: また、目的のタイルプロバイダに基づいて**背景レイヤーを変更する**こともできます(デフォルトはBing Aerial Imagery)。

source: You can add your own map tiles by clicking on **Custom**. For example, if you want to **add a Field Paper** [1], click **Custom** then click on the magnifying glass (search) icon to open the following window:
ja: **Custom**をクリックすると、独自のマップタイルを追加できます。たとえば、Field Paper**[1]を**追加する場合は、**Custom**をクリックし、虫眼鏡(検索)アイコンをクリックして次のウィンドウを開きます。

source: Enter your **FieldPaper snapshot URL**, which will be something like this: http://fieldpapers.org/snapshots/cqhmf2v9#18/37.80593/-122.22715
ja: **FieldPaperのスナップショットURL**を入力します。次のようになります。http://fieldpapers.org/snapshots/cqhmf2v9#18/37.80593/-122.22715

source: To **display GPS tracks from your computer** (GPX format), drag and drop the GPX file into iD editor.
ja: **お使いのコンピュータからGPSトラックを表示**(GPXフォーマット)するには、GPXファイルをiDエディタにドラッグ&ドロップします。

source: To enable **OpenStreetMap GPS traces** click on the box. In the image below, public GPS traces are shown in various colors, indicating the direction of travel.
ja: **OpenStreetMap GPSトレース**を有効にするには、ボックスをクリックします。下のイメージでは、公共のGPS追跡がさまざまな色で表示され、進行方向を示しています。

source: If there is `imagery offset </en/josm/aerial-imagery>`__, you can **correct the imagery offset** by clicking **Fix Alignment**.
ja: `imagery offset</en/josm/aerial-imagery>`__がある場合は、**Fix Alignment**をクリックして**image offset**を修正できます。

source: Click the navigation buttons to move the imagery. Click the reset button to return to the default position. |image20|
ja: イメージを移動するには、ナビゲーションボタンをクリックします。リセットボタンをクリックすると、デフォルトの位置に戻ります。|image20|

source: Adding points
ja: ポイントを追加する

source: To add a new point, click on the **Point** button. |image3|
ja: 新しい点を追加するには、[**Point**]ボタンをクリックします。|image3|

source: Your mouse cursor will change into plus (+) sign. Now, click on a position that you know to mark a location. For example, if you know that there is a hospital in your area, click on the position of the hospital building.
ja: マウスカーソルがプラス(+)記号に変わります。次に、位置をマークする位置をクリックします。たとえば、地域に病院があることがわかっている場合は、病院の建物の位置をクリックします。

source: Notice that a new point is added. At the same time, the left panel will change to show a form where you can select attributes for the object. Click **Hospital Grounds** to tag the point as a hospital.
ja: 新しい点が追加されます。同時に、左側のパネルが変わり、オブジェクトの属性を選択できるフォームが表示されます。**Hospital Grounds**をクリックして、ポイントに病院のタグを付けます。

source: You can use the forms to fill detail information about your point. You can fill hospital name, address, and/or other additional information. Note that each feature will have different options, depending on what tag you choose from the feature panel.
ja: フォームを使用して、ポイントに関する詳細情報を入力できます。病院の名前、住所、その他の追加情報を入力できます。各フィーチャには、フィーチャパネルから選択したタグに応じて異なるオプションがあることに注意してください。

source: If you make a mistake, such as a wrong location, you can move your point to a new location by holding the left mouse button on your point and dragging it. Or, if you want to delete your point, click the left mouse button on the point, activate the context menu by clicking with the right mouse button and then click the button which looks like a trashcan. |image23|
ja: 位置を間違えた場合などに、マウスの左ボタンを押したままドラッグすると、ポイントを新しい位置に移動できます。または、ポイントを削除する場合は、ポイント上で左マウスボタンをクリックし、さらに右マウスボタンでクリックしてコンテキストメニューを表示し、ごみ箱のボタンをクリックします。|image23|

source: A "point" created in the iD editor is actually a standalone "node" with a set of "tags" on it.
ja: iDエディタで作成される"ポイント"は、実際には"タグ"のセットが付いた独立の"ノード"です。

source: Drawing lines
ja: 線の描画

source: To add a new line, click on the **Line** button. |image4|
ja: 新しいラインを追加するには、**ライン**ボタンをクリックします。|image4|

source: Your mouse cursor will change into plus (+) sign. Find a road that hasn’t been drawn on the map and trace it. Click once on a point where the road segment begins, move your mouse, and click to add additional points. Double-click to end the drawing process. Notice the panel on the left.
ja: マウスカーソルがプラス(+)記号に変わります。地図に描かれていない道を探して、たどってみましょう。道路セグメントの始点を1回クリックし、マウスを移動してクリックし、点を追加します。図面プロセスを終了するには、ダブルクリックします。左側のパネルに注目してください。

source: Just as with a point, select the appropriate tags for your line.
ja: 点の場合と同様に、線分に適切なタグを選択します。

source: You can drag points from the line by clicking your left mouse button on a point and dragging it.
ja: ポイント上でマウスの左ボタンをクリックしてドラッグすると、ラインからポイントをドラッグできます。

source: You also can move the whole line by selecting it, and choosing the **Move tool**. Then drag the line to a new position. |image30|
ja: ライン全体を移動するには、ラインを選択して**移動ツール**を選択します。次に、ラインを新しい位置にドラッグします。|image30|

source: When you click your left mouse button on an individual point (node) on the line and click on the right mouse button to activate the context menu, you will see these tools:
ja: ラインの個々のポイント(ノード)上で左マウスボタンをクリックし、さらに右マウスボタンをクリックしてコンテキストメニューを表示すると、次のツールが表示されます。

source: Delete point from line. |image23|
ja: ラインからポイントを削除します。|image23|

source: Disconnect point from line. |image26|
ja: ポイントをラインから切断します。|image26|

source: Split a line into two lines from the point you’ve selected. |image27|
ja: 選択したポイントから2本のラインに分割します。|image27|

source: When you click your left mouse button on a line (but not on a point), you will see these tools:
ja: ライン上(ポイント上ではない)でマウスの左ボタンをクリックすると、次のツールが表示されます。

source: Delete line. |image23|
ja: ラインの削除。|image23|

source: Create a circle from a line (only active if the line is closed) |image29|
ja: 線分から円を作成する(ラインが閉じている場合にのみ有効) |image29|

source: Move line |image30|
ja: ラインを移動 |image30|

source: Form a square shape from a line (only active if the line is closed) |image31|
ja: 線分から四角形を作成する(ラインが閉じている場合のみ有効)) |image31|

source: Reverse line direction (good for rivers & one-way streets) |image32|
ja: ラインの方向を逆転 (河川や一方通行の設定に便利) |image32|

source: A "line" created in the iD editor is actually a "way" with "tags" on it.
ja: iDエディタで作成される "ライン"は、実際には"タグ"がついた"ウエイ"です。

source: A special note about **Deleting**: In general you should avoid deleting other people's mapping if it just needs improvement. You can delete your own mistakes, but you should try to *adjust* other people's mapped objects if they need changes. This preserves the history of the items in the OSM database and is respectful of fellow mappers. If you really feel something should be deleted, consider asking the original mapper or one of the OSM email lists about it first.
ja: **削除**に関する特記事項: 一般的に、改善が必要な場合は、他のユーザのマッピングを削除しないようにしてください。自分の間違いを削除することもできますが、変更が必要な場合は、他のユーザのマッピングされたオブジェクトを*調整*してみてください。これにより、OSMデータベース内のアイテムの履歴が保持され、他のマッパーにも配慮されます。削除する必要があると本当に感じている場合は、最初に元のマッパーまたはOSM電子メールリストのいずれかに問い合わせてみてください。

source: Drawing shapes (polygons)
ja: シェイプ(ポリゴン)を描画する

source: To add a new multi-sided shape, click on the **Area** button.
ja: 新しい多辺形状を追加するには、**領域**ボタンをクリックします。

source: Your mouse cursor will change into plus (+) sign. Try to trace a building using the imagery as a guide.
ja: マウスカーソルがプラス(+)記号に変わります。イメージをガイドとして使用して、建物をトレースしてみます。

source: You will notice that the color of your shape will change depending on the attributes that you assign to it. |image35|
ja: シェイプのカラーは、割り当てるアトリビュートに応じて変化します。|image35|

source: The tools that are available when you select a shape and activate the context menu with the right mouse button are similar to those when you click on a line.
ja: シェイプを選択して右マウスボタンでコンテキストメニューを表示したときに使用できるツールは、ラインをクリックしたときのツールと似ています。

source: A "polygon" in the iD editor is actually a "closed way" with tags on it.
ja: iDエディタの"ポリゴン"は、実際にはタグが付いた"閉じたウエイ"です。

source: Drawing multipolygons
ja: マルチポリゴンを描画する

source: Sometimes you have to draw a polygon which does not only have an outer contour but also one or more inner contours. Just think of buildings with inner courtyards or lakes with islands. *Do not draw all these ways in one line* so that the inner contours suspend from the outer contour. Rather draw these contours separate, attach tags to the outer contour only, select all contours and hit **c** in order to combine them into what is called a multipolygon.
ja: 外部輪郭だけでなく、1つまたは複数の内部輪郭を持つポリゴンを描画する必要がある場合があります。中庭のある建物や島のある湖を思い浮かべてください*これらのすべての方法を1本の線で描画しないでください*。内側の輪郭線が外側の輪郭線から一時停止します。むしろ、これらの等高線を別々に描き、外側の等高線のみにタグを付け、すべての等高線を選択して**c**を押し、それらをいわゆるマルチポリゴンに結合します。

source: When you select any of the contours of the newly created multipolygon you can see on the left to which multipolygons it belongs
ja: 新しく作成したマルチポリゴンのいずれかの輪郭を選択すると、そのマルチポリゴンが属する残りのオブジェクトを確認できます。

source: Saving your changes
ja: 変更を保存する

source: When (and if) you want to save your edits to OpenStreetMap, click the **Save** button. The panel on the left will show the upload panel.
ja: 編集内容をOpenStreetMapに保存する場合は、[**保存**]ボタンをクリックします。左側のパネルにアップロード・パネルが表示されます。

source: Enter a comment about your edits and click **Save**.
ja: 編集内容についてのコメントを入力し、**保存**をクリックします。

source: If you have edited the same feature (point, way or area) at the same time as another person was editing it, you will receive a warning that your edits cannot be uploaded until you have resolved the **conflicts** - choose whose edits to accept & upload your changes. *Resolving conflicts often involves accepting the other persons edits, in which case you will probably wish to return to the feature in question and edit again (**this time save soon after the edit to try to avoid a conflict again!**).*
ja: 他のユーザが編集していたのと同時に同じフィーチャ(点、経路、または領域)を編集した場合は、**衝突**を解決するまで編集をアップロードできないという警告が表示されます。変更を受け入れてアップロードする編集を選択してください。*コンフリクトを解決するには、多くの場合、他のユーザによる編集を受け入れる必要があります。その場合は、問題のフィーチャーに戻って再度編集することをお勧めします(**今回は編集後すぐに保存して、再度コンフリクトを回避します!**)。*

source: Add additional information and custom tags
ja: 追加情報とカスタムタグの追加

source: When you are editing an object, you will see a strip of icons at the bottom of the attribute panel. You can add additional information by clicking these icons:
ja: オブジェクトを編集すると、属性パネルの下部にアイコンのストリップが表示されます。次のアイコンをクリックすると、追加情報を追加できます。

source: Add elevation |image37|
ja: 標高の追加 |image37|

source: Add notes |image38|
ja: ノートの追加 |image38|

source: Add contacts / phone number |image39|
ja: 連絡先/電話番号の追加 |image39|

source: Add source tag |image40|
ja: sourceタグの追加 |image40|

source: Add website |image41|
ja: websiteの追加 |image41|

source: Add accessibility information |image42|
ja: アクセスのしやすさ情報を追加 |image42|

source: Add Wikipedia link |image43|
ja: Wikipediaリンクを追加 |image43|

source: Or, you can add custom tags by clicking **All tags**. |image44|
ja: または、カスタムタグを **全タグ**をクリックして追加。|image44|

source: This will show all the tags attached to the feature.
ja: これにより、フィーチャにアタッチされているすべてのタグが表示されます。

source: Click the plus sign (+) to add keys and values or click the trash icon to delete tags.
ja: プラス記号(+)をクリックしてキーと値を追加するか、ごみ箱アイコンをクリックしてタグを削除します。

source: What next?
ja: 次のステップ

source: Try the LearnOSM documentation, from which this quickstart was derived: https://learnosm.org/en/beginner/id-editor/
ja: このクイックスタートが派生したLearnOSMのドキュメントを試してください:https://learnosm.org/en/beginner/idエディタ/

source: Website: https://wiki.openstreetmap.org/wiki/ID
ja: Webサイト: https://wiki.openstreetmap.org/wiki/ID
